/*************************************************************************
	> File Name: 8.15_9.c
	> Author: 
	> Mail: 
	> Created Time: 2017年08月15日 00时54分40秒 PDT
 ************************************************************************/

#include<stdio.h>
int main()
{
    int a[2][3] = {{1,2, 4}, {3,4,5}};
    printf("a:%p\n&a[0]:%p\n", a, &a[0]);

    printf("&a + 1: %p\na+1: %p\n", &a + 1, a+1);
    
    int *p = a[0];
    //int (*p)[3];
    //p = a;

    for(int i= 0; i < 2; ++i)
    {
        for(int j = 0; j < 3; ++j)
        {
            printf("%d", *(p + i*3 + j));
            printf("%d ", *(p + 3*i +j));
            //printf("%d ", *(*(p + i)+ j));
        }
    }
    return 0;
}
